galangl/SRBean/sdkconfig.defaults
# Enable Bluetooth
CONFIG_BT_ENABLED=y

# Use NimBLE host stack
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n

# Need 2 concurrent connections: real roaster (client) + HiBean (server)
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2

CONFIG_BT_NIMBLE_ACL_BUF_COUNT=24
CONFIG_BT_NIMBLE_MSYS_BUF_FROM_HEAP=y

# Target chip
CONFIG_IDF_TARGET="esp32s3"
